FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_LPC54018_MCUXpresso/NXP_Code/device/LPC54018.h
/** ROM API base address */
#define ROM_API_BASE                             (0x03000200u)
/** ROM API base pointer */
#define ROM_API                                  (*(ROM_API_Type**) ROM_API_BASE)
/** OTP API base pointer */
#define OTP_API                                  (ROM_API->otpApiBase)

/** Used for selecting the address of FROHF setting API in ROM */
#define FSL_FROHF_SETTING_API_ADDRESS_DETERMINE_BY_ROM_VERSION 1U
#define FSL_ROM_VERSION_0A 0U
#define FSL_ROM_VERSION_1B 1U
#define FSL_ROM_VERSION_0A_FRO_SETTING_ADDR 0x03007933U
#define FSL_ROM_VERSION_1B_FRO_SETTING_ADDR 0x03008D9BU

/*!
 * @brief Get the chip value.
 *
 * @return chip version, 0x0: 0A version chip, 0x1: 1B version chip, 0xFF: invalid version.
 */
static inline uint32_t Chip_GetVersion(void)
{
    uint8_t romVersion = 0U;
    uint32_t command[5] = {0U}, result[4] = {0U};
    uint32_t syscon_iap_entry_location = 0x03000205;

    command[0] = 55U;
    result[0]  = 0;
    result[1]  = 0;
    ((void (*)(uint32_t cmd[5], uint32_t stat[4]))syscon_iap_entry_location)(command, result);

    romVersion = (uint8_t)(result[1]);

    if (0U == result[0])
    {
       if (romVersion == FSL_ROM_VERSION_1B)
       {
          return FSL_ROM_VERSION_1B;
       }
       else if (romVersion == FSL_ROM_VERSION_0A)
       {
          return FSL_ROM_VERSION_0A;
       }
       else
       {
          return 0xFF;
       }
    }
    else
    {
       return 0xFF;
    }
}

/*!
 * @}
 */ /* end of group SDK_Compatibility_Symbols */


#endif  /* _LPC54018_H_ */
